{
  "projects": [
    {
      "visible": true,
      "category": "Data Governance & Management",
      "title": "Data Landscape Scanner",
      "description": "The Data Landscape Scanner project revolutionizes data discovery and governance by supporting over 40 technologies, including Oracle, Snowflake, AWS Glue, and Tableau. Built on Java with Akka Streams, it enables efficient data stream processing and customization through user-defined queries. My contributions include mitigating SQL Injection vulnerabilities, enhancing connectors, and implementing tag discovery for database objects, ensuring robust data organization and classification. Additionally, I optimized scanners for Azure Synapse, Databricks, and Snowflake, while building connectors for dbt, Kafka, and PowerBI, enabling seamless data cataloguing and lineage across platforms.",
      "tags": ["Meta Data Management", "Data Discovery"],
      "image": {
        "src": "../../images/mdm.png",
        "alt": "Data Governance & Management",
        "linkTo": ""
      }
    },
    {
      "visible": true,
      "category": "Data Engineering & Platform Development",
      "title": "Unified Data Platform (UDP)",
      "description": "TThe Unified Data Platform (UDP) simplifies big data pipeline design and deployment by abstracting infrastructure complexities, allowing users to focus on core tasks. As a team lead, I ensured timely sprint deliveries, automated features to cut manual testing time, and boosted code coverage from 10% to 80%. Additionally, I optimized code to reduce OWASP vulnerabilities, developed a UI dashboard, and onboarded new team members while independently driving feature development and bug fixes.",
      "tags": ["Big Data", "Automation", "Code Optimization"],
      "image": {
        "src": "../../images/etl.jpg",
        "alt": "Data Engineering & Platform Development"
      }
    },
    {
      "visible": true,
      "category": "Software Development & Realtime event streaming",
      "title": "Error Reprocessing Tool (ERT)",
      "description": "The Error Reprocessing Tool (ERT) is a near real-time platform for reprocessing system errors, built on Spring Boot and Spring Cloud Stream. It includes the Sync tool for Kafka data ingestion and the ERT API for error filtering, pagination, and batch reprocessing, alongside an interactive UI dashboard for error management. As a Fullstack developer, I designed and built ERT from scratch, enabling domain-level data partitioning, load balancing, and reprocessing 1 million records in under an hour, while also leading its deployment in new markets.",
      "tags": ["Error Reprocessing", "Real-Time Systems", "Spring Boot"],
      "image": {
        "src": "../../images/kafka-intro.png",
        "alt": "Software Development & Realtime event streaming"
      }
    }
  ],
  "button": {
    "visible": false,
    "label": "Visit on Github",
    "url": "https://github.com/konstantinmuenster/gatsby-theme-portfolio-minimal"
  }
}
